Herimarque-soap-client/request/area_detail_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:head="http://apache.org/headers" xmlns:ser="http://service.areacrlts.crlts.cha/">
   <soapenv:Header>
      <head:ComMsgHeader>
         <RequestMsgID>netinamu42</RequestMsgID>
         <!-- <ServiceKey>6i1zuQWddVTMFSqlHyhnbw8VL7uvfuHHt3Pth12H3VuFrUvdzFRcfYBZRfTE0Eidf/hV3otAz36MR1F/VDWUDw==</ServiceKey> -->
         <ServiceKey>r4kz8tI1CNlZ/CnyNqeS/qjFaWpwFfjbj+DlBFL7t5/aYDO5N63Ec748ICA0FQJ2dAzgWtY49qqNrgNF+dvubw==</ServiceKey>
      </head:ComMsgHeader>
   </soapenv:Header>
   <soapenv:Body>
      <ser:getAreaCrltsDtls>
         <!--Optional:-->
         <arg0>
           <itemCd>code</itemCd>
           <crltsNo>number</crltsNo>
           <ctrdCd>locale</ctrdCd> 
         </arg0>
      </ser:getAreaCrltsDtls>
   </soapenv:Body>
</soapenv:Envelope>